content/blog/imagine-working-in-engineering-at-helpshift.md
+++
title = "Imagine Working in Engineering at Helpshift"
author = ["Vedang Manerikar"]
date = 2017-09-07T07:27:00+05:30
aliases = ["/weblog/2017-09-05-imagine-working-in-engineering-at-helpshift/"]
lastmod = 2020-04-05T18:49:44+05:30
tags = ["culture", "helpshift"]
categories = ["interviews"]
draft = false
creator = "Emacs 26.1 (Org mode 9.3.6 + ox-hugo)"
toc = true
+++

_Cross-posted from my interview published on [Helpshift's Medium blog](https://medium.com/@helpshift/image-ine-working-in-engineering-at-helpshift-8818247e2188)_

-   Name: Vedang Manerikar
-   Current Role: Principal Engineering Manager, Backend
-   How long you have been with Helpshift?: 7 years

<!--more-->


## What does your day-to-day at Helpshift look like? {#what-does-your-day-to-day-at-helpshift-look-like}

My day-to-day is unblocking people and getting things done!

I review architecture, read code, enable customer service, help
product guys understand the engineering pros and cons of their
product decisions and prioritize work for maximum productivity. I
work with an amazing team. They make all of this possible and
achievable.

That means I also get to hang out with my best friends, catch up
on their day-to-day, laugh at inside jokes that have been running
for years and overall have a blast. Seven years at a place lets
you build deep relationships and puts a smile on your face when
you think about work!


## What has been your favorite off-site team oriented event, and why? {#what-has-been-your-favorite-off-site-team-oriented-event-and-why}

When we were cash-strapped and raising funds, a team off-site was
the running joke of the company. "After Series A!", we would raise
our glasses and say. As time went on without funding in sight,
every request turned into "After Series A!".

So when we did raise our first round, we treated ourselves to a
long weekend at a spectacular villa in Goa. It was a heady
celebration and the world was our oyster. It remains my favorite
off-site because the funding felt like validation.


## What role(s) did you start in at Helpshift and how have you graduated/migrated into different roles? {#what-role--s--did-you-start-in-at-helpshift-and-how-have-you-graduated-migrated-into-different-roles}

I came to Helpshift with a strong systems background: writing
kernel modules and working on storage replication. I started
writing Python at Helpshift and then graduated to Clojure (in
2011, when almost no one else was writing Clojure). I've since
written and helped design large chunks of the Helpshift
architecture, and have learnt interesting things about distributed
systems through trial-by-fire. Today, I make an impact by making
sure my team has clear, unambiguous goals and all the resources to
achieve these goals.


## Favorite thing about working for an SF tech startup: {#favorite-thing-about-working-for-an-sf-tech-startup}

I have a lot of "favorite things" about working at Helpshift (We
keep our workplace fun!). A small example of this is that on any
given day someone or the other will bring home-made snacks and
goodies for the others to enjoy.


## What advice would you have for prospective Helpshift candidates? {#what-advice-would-you-have-for-prospective-helpshift-candidates}

We're still a small enough company that everyone knows everyone
else by name. If you're the kind of person who wants to get in on
the ground floor and grow with a company, we're perfect for you.
Come with a no-nonsense, no-bullshit attitude. Be a kind person.


## What is your proudest moment at Helpshift? {#what-is-your-proudest-moment-at-helpshift}

My colleagues and I have taken this company from serving 0
requests per second to serving 50,000 requests per second. We're
installed in over 2 Billion devices in the world. That means that
there's a 50% chance that you (reader) have us installed in one of
the apps on your phone. That sentence is a source of great pride
for me.


## How would you describe the company culture and what do you like most about it? {#how-would-you-describe-the-company-culture-and-what-do-you-like-most-about-it}

As a company, we've always looked for attitude over smarts. We
want people who are good listeners and good communicators. We want
people who are passionate and hold strong opinions. We want people
who care about quality. This is the culture that we've always
striven to maintain at Helpshift.


## Superpower (real or fake): Obscure Emacs shortcuts. {#superpower--real-or-fake--obscure-emacs-shortcuts-dot}

Give a man Emacs and he'll get some programming done. Teach a man
how to tweak it and play with it and he'll happily shave yaks for
the rest of his life.


## Slightly addicted to: Tea. {#slightly-addicted-to-tea-dot}

Walking out of the office to have road-side tea in the evening is
an old Helpshift tradition. I'm always on the lookout for great
Masala Chai, and if you come to my home I'll whip up a fantastic
cup of tea for us to chat over!


## Always on the search for the perfect: new book to read. {#always-on-the-search-for-the-perfect-new-book-to-read-dot}

Reading is one of my favorite ways to unwind. I read anything that
I can get my hands on: fantasies, travelogues, thrillers, pop
psychology, autobiographies, technical books, comics, you name it!


## If you could interview one person, dead or alive, who would it be and why? {#if-you-could-interview-one-person-dead-or-alive-who-would-it-be-and-why}

Isaac Newton or Albert Einstein or Alan Turing! (Sorry I cheated.)
These were phenomenal people with world-changing ideas. How did
they get them? How did they remain productive all their life? What
did "work" mean for them? What was their work day like? What did
they do to unwind? What did they do for leisure? Who did <span class="underline">they</span>
look up to? I'd love to know these answers!
